In [1]:
import pandas as pd

In [3]:
data1 = pd.read_csv("train.csv")
data1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data1.drop(['PassengerId','Name','Parch','Ticket','Embarked','SibSp','Cabin'], axis = 1, inplace = True)
data1.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
data1.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [7]:
data1['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [8]:
data1['Age'].fillna(data1['Age'].mean(),inplace = True)
data1['Age'].isnull().sum()

0

In [9]:
s_dummy = pd.get_dummies(data1['Sex'],drop_first = True)

In [10]:
data1 = pd.concat([data1,s_dummy],axis = 1)

In [11]:
data1.head()

   Survived  Pclass     Sex   Age     Fare  male
0         0       3    male  22.0   7.2500     1
1         1       1  female  38.0  71.2833     0
2         1       3  female  26.0   7.9250     0
3         1       1  female  35.0  53.1000     0
4         0       3    male  35.0   8.0500     1

In [12]:
data1.drop(['Sex'],axis = 1, inplace = True)
data1.head()

   Survived  Pclass   Age     Fare  male
0         0       3  22.0   7.2500     1
1         1       1  38.0  71.2833     0
2         1       3  26.0   7.9250     0
3         1       1  35.0  53.1000     0
4         0       3  35.0   8.0500     1

In [13]:
from sklearn.preprocessing import StandardScaler
st = StandardScaler()

In [14]:
f_Scale = ['Age','Fare']
data1[f_Scale] = st.fit_transform(data1[f_Scale])

In [15]:
data1.head()

   Survived  Pclass       Age      Fare  male
0         0       3 -0.592481 -0.502445     1
1         1       1  0.638789  0.786845     0
2         1       3 -0.284663 -0.488854     0
3         1       1  0.407926  0.420730     0
4         0       3  0.407926 -0.486337     1

In [16]:
x = data1.drop(['Survived'],axis = 1)
y = data1['Survived']

In [18]:
from sklearn.model_selection import GridSearchCV
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC

In [21]:
#creating Param
model_param = {
    'DecisionTreeClassifier':{
        'model':DecisionTreeClassifier(),
        'param':{
            'criterion':['gini', 'entropy']
        }
    },
    'KNeighborsClassifier' :{
        'model':KNeighborsClassifier(),
        'param':{
            'n_neighbors':[5,10,15,20,25]
        }
    },
    'SVC':{
        'model':SVC(),
        'param':{
            'kernel':['rbf','linear','sigmoid'],
            'C':[0.1,1,10,100]
        }
    }
}

In [22]:
score = []
for model_name,mp in model_param.items():
    model_selection = GridSearchCV(estimator = mp['model'],param_grid = mp['param'],cv=5,return_train_score = False)
    model_selection.fit(x,y)
    score.append({
        'model':model_name,
        'best_score':model_selection.best_score_,
        'best_params':model_selection.best_params_
    })

In [24]:
data1_model_score = pd.DataFrame(score,columns = ['model','best_score','best_params'])

In [25]:
data1_model_score

                    model  best_score                  best_params
0  DecisionTreeClassifier    0.777848        {'criterion': 'gini'}
1    KNeighborsClassifier    0.802492           {'n_neighbors': 5}
2                     SVC    0.811481  {'C': 100, 'kernel': 'rbf'}

In [27]:
model_Svc = SVC(C = 100,kernel = 'rbf')

In [29]:
model_Svc.fit(x,y)

SVC(C=100)

In [30]:
data2 = pd.read_csv('test.csv')

In [31]:
data2.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [32]:
data3 = data2.drop(['PassengerId','Name','Ticket','Cabin','Embarked','SibSp','Parch'],axis = 1)

In [33]:
data3.isnull().sum()

Pclass     0
Sex        0
Age       86
Fare       1
dtype: int64

In [34]:
data3['Age'].fillna(data3['Age'].mean(),inplace = True)
data3['Fare'].fillna(data3['Fare'].mean(),inplace = True)

In [35]:
sex_dum = pd.get_dummies(data3['Sex'],drop_first = True)
data3 = pd.concat([data3,sex_dum],axis = 1)
data3.drop(['Sex'],axis = 1, inplace = True)

In [36]:
data3.head()

   Pclass   Age     Fare  male
0       3  34.5   7.8292     1
1       3  47.0   7.0000     0
2       2  62.0   9.6875     1
3       3  27.0   8.6625     1
4       3  22.0  12.2875     0

In [40]:
data3[f_Scale] = st.fit_transform(data3[f_Scale])

In [41]:
data3.head()

   Pclass       Age      Fare  male
0       3  0.334993 -0.498407     1
1       3  1.325530 -0.513274     0
2       2  2.514175 -0.465088     1
3       3 -0.259330 -0.483466     1
4       3 -0.655545 -0.418471     0

In [43]:
y_predict = model_Svc.predict(data3)

In [44]:
submission = pd.DataFrame({
    'PassengerId':data2['PassengerId'],
    'Survived':y_predict
})

In [45]:
submission.to_csv('titanic_Final_Submission.csv',index = False)